app/controllers/admins/boke_tukkomis_controller.rb

  def show
    @search = BokeTukkomi.where({genre_id: params[:id]}).ransack(params[:q])
    @boke_tukkomis = @search.result.page(params[:page]).per(10)
    @genre = Genre.find(params[:id])
---
SELECT  "boke_tukkomis".* FROM "boke_tukkomis" WHERE "boke_tukkomis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "boke_tukkomis".* FROM "boke_tukkomis" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "boke_tukkomis"
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def plan
    @search = Genre.ransack(params[:q])
    @genres = @search.result.page(params[:page]).per(10)
---
SELECT  "genres".* FROM "genres" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def create
    @boke_tukkomi = BokeTukkomi.new(boke_tukkomi_params)
      if @boke_tukkomi.save
---
INSERT INTO "boke_tukkomis" ("genre_id", "boke", "tukkomi", "page", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["genre_id", 1], ["boke", "ブーン（車パクって逃げる）"], ["tukkomi", "おい、逃げるな！逃げるな！"], ["page", 4], ["name", "デート"], ["created_at", "2020-07-14 10:37:28.947200"], ["updated_at", "2020-07-14 10:37:28.947200"]]

  def show1
    @boke_tukkomi = BokeTukkomi.find(params[:id])
---
SELECT  "boke_tukkomis".* FROM "boke_tukkomis" WHERE "boke_tukkomis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @boke_tukkomi = BokeTukkomi.find(params[:id])
---
SELECT  "boke_tukkomis".* FROM "boke_tukkomis" WHERE "boke_tukkomis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @boke_tukkomi = BokeTukkomi.find(params[:id])
    if @boke_tukkomi.update(boke_tukkomi_params)
---
SELECT  "boke_tukkomis".* FROM "boke_tukkomis" WHERE "boke_tukkomis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "boke_tukkomis" SET "boke" = ?, "updated_at" = ? WHERE "boke_tukkomis"."id" = ?  [["boke", "ネタ合わせしよや"], ["updated_at", "2020-07-14 07:47:55.612864"], ["id", 1]]