app/controllers/admins/boke_tukkomis_controller.rb

  def index
    @search = BokeTukkomi.ransack(params[:q])
    @boke_tukkomis = @search.result.page(params[:page]).per(10)
---
SELECT  "boke_tukkomis".* FROM "boke_tukkomis" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "boke_tukkomis"