app/controllers/admins/genres_controller.rb

SELECT  "genres".* FROM "genres" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
def index
  @genre = Genre.new
  @search = Genre.ransack(params[:q])
  @genres = @search.result.page(params[:page]).per(10)

INSERT INTO "genres" ("name", "is_genres_status", "setting", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "漫才コント"], ["is_genres_status", 0], ["setting", "合コン"], ["created_at", "2020-07-15 02:43:46.425835"], ["updated_at", "2020-07-15 02:43:46.425835"]]
---
def create
  @genre = Genre.new(genre_params)
  if @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "genres" SET "is_genres_status" = ?, "setting" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["is_genres_status", 1], ["setting", "取り調べ"], ["updated_at", "2020-07-15 02:44:04.231641"], ["id", 5]]
---
def update
  @genre = Genre.find(params[:id])
  if @genre.update(genre_params)