app/controllers/admins/users_controller.rb

  def index
   @search = User.ransack(params[:q])
   @users = @search.result.page(params[:page]).per(10)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def update
   @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "is_users_status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_users_status", 1], ["updated_at", "2020-07-12 09:00:34.468924"], ["id", 1]]