app/views/admins/genres/index.html.erb

SELECT "genres".* FROM "genres"
---
      <%= f.label :ジャンル %>
      <%= f.select :category,Genre.categories.keys,{}, class:"form-control" %>