app/views/users/boke_tukkomis/show6.html.erb

        <% @boke_tukkomis.each do |boke_tukkomi| %>
        <% if boke_tukkomi.genre.setting == 'デート' && boke_tukkomi.page == 6 %>
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]