app/views/users/boke_tukkomis/show.html.erb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <% @boke_tukkomis.each do |boke_tukkomi| %>
        <% if boke_tukkomi.genre.setting == 'デート' && boke_tukkomi.page == 1 %>