app/views/admins/boke_tukkomis/edit.html.erb

SELECT "genres".* FROM "genres"
---
            <th>ジャンル</th>
            <td><%= f.collection_select :genre_id, Genre.all ,:id, :name, include_blank: "--選択してください--" %></td>