app/controllers/users/boke_tukkomis_controller.rb

SELECT  "genres".* FROM "genres" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "genres"
SELECT  "genres".* FROM "genres" ORDER BY "genres"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @search = Genre.ransack(params[:q])
    @genres = @search.result.page(params[:page]).per(10)
    @genre1 = Genre.first

INSERT INTO "boke_tukkomis" ("genre_id", "boke", "tukkomi", "page", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["genre_id", 1], ["boke", "ネタ合わせしよや。"], ["tukkomi", "お前やないか。違う女の子役をやって欲しい。"], ["page", 1], ["created_at", "2020-07-16 12:41:31.997084"], ["updated_at", "2020-07-16 12:41:31.997084"]]
---
  def create
    parse_boke_tukkomi = JSON.parse(params[:boke_tukkomi])

    boke_tukkomi = BokeTukkomi.new(boke: parse_boke_tukkomi["boke"],tukkomi: parse_boke_tukkomi["tukkomi"], genre_id: params[:genre_id], page: params[:page])
    if boke_tukkomi.save

SELECT COUNT(DISTINCT "boke_tukkomis"."boke") FROM "boke_tukkomis" WHERE "boke_tukkomis"."page" = ?  [["page", 1]]
SELECT  DISTINCT "boke_tukkomis"."boke" FROM "boke_tukkomis" WHERE "boke_tukkomis"."page" = ? AND "boke_tukkomis"."genre_id" = ? LIMIT ?  [["page", 1], ["genre_id", 1], ["LIMIT", 11]]
---
  def date1
    @boke_tukkomi = BokeTukkomi.new
    @boke_tukkomis = BokeTukkomi.where(page: 1, genre_id: 1).select(:boke,:tukkomi).distinct

SELECT  DISTINCT "boke_tukkomis"."boke" FROM "boke_tukkomis" WHERE "boke_tukkomis"."page" = ? LIMIT ?  [["page", 1], ["LIMIT", 11]]
---
  def date2
    @boke_tukkomis = BokeTukkomi.new
    @boke_tukkomis = BokeTukkomi.where(page: 2, genre_id: 1).select(:boke,:tukkomi).distinct

SELECT DISTINCT "boke_tukkomis"."boke", "boke_tukkomis"."tukkomi" FROM "boke_tukkomis" WHERE "boke_tukkomis"."page" = ? AND "boke_tukkomis"."genre_id" = ?  [["page", 3], ["genre_id", 1]]
---
  def date3
    @boke_tukkomis = BokeTukkomi.new
    @boke_tukkomis = BokeTukkomi.where(page: 3, genre_id: 1).select(:boke,:tukkomi).distinct

SELECT DISTINCT "boke_tukkomis"."boke", "boke_tukkomis"."tukkomi" FROM "boke_tukkomis" WHERE "boke_tukkomis"."page" = ? AND "boke_tukkomis"."genre_id" = ?  [["page", 4], ["genre_id", 1]]
---
  def date4
    @boke_tukkomis = BokeTukkomi.new
    @boke_tukkomis = BokeTukkomi.where(page: 4, genre_id: 1).select(:boke,:tukkomi).distinct

SELECT DISTINCT "boke_tukkomis"."boke", "boke_tukkomis"."tukkomi" FROM "boke_tukkomis" WHERE "boke_tukkomis"."page" = ? AND "boke_tukkomis"."genre_id" = ?  [["page", 5], ["genre_id", 1]]
---
  def date5
    @boke_tukkomis = BokeTukkomi.new
    @boke_tukkomis = BokeTukkomi.where(page: 5, genre_id: 1).select(:boke,:tukkomi).distinct

SELECT DISTINCT "boke_tukkomis"."boke", "boke_tukkomis"."tukkomi" FROM "boke_tukkomis" WHERE "boke_tukkomis"."page" = ? AND "boke_tukkomis"."genre_id" = ?  [["page", 6], ["genre_id", 1]]
---
  def date6
    @boke_tukkomis = BokeTukkomi. new
    @boke_tukkomis = BokeTukkomi.where(page: 6, genre_id: 1).select(:boke,:tukkomi).distinct

SELECT DISTINCT "boke_tukkomis"."boke", "boke_tukkomis"."tukkomi" FROM "boke_tukkomis" WHERE "boke_tukkomis"."page" = ? AND "boke_tukkomis"."genre_id" = ?  [["page", 7], ["genre_id", 1]]
---
  def date7
    @boke_tukkomis = BokeTukkomi.new
    @boke_tukkomis = BokeTukkomi.where(page: 7, genre_id: 1).select(:boke,:tukkomi).distinct

SELECT DISTINCT "boke_tukkomis"."boke", "boke_tukkomis"."tukkomi" FROM "boke_tukkomis" WHERE "boke_tukkomis"."page" = ? AND "boke_tukkomis"."genre_id" = ?  [["page", 8], ["genre_id", 1]]
---
  def date8
    @boke_tukkomis = BokeTukkomi.new
    @boke_tukkomis = BokeTukkomi.where(page: 8, genre_id: 1).select(:boke,:tukkomi).distinct