app/controllers/users/users_controller.rb

UPDATE "users" SET "first_name_kana" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name_kana", "マサ"], ["updated_at", "2020-07-12 08:52:52.142624"], ["id", 1]]
---
  def update
    @user = current_user
    if @user.update(user_params)

UPDATE "users" SET "is_users_status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_users_status", 0], ["updated_at", "2020-07-12 08:56:41.220881"], ["id", 1]]
---
  def withdraw
      @user = current_user

      # is_customer_statusカラムにフラグを立てる(default→false(有効状態)をtrue(無効状態)にする）
      @user.update(is_users_status: false)